<a href="https://colab.research.google.com/github/Adassa86/Exo/blob/main/exo2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
-- Database: Library

-- DROP DATABASE "Library";

CREATE TABLE library(
 Library_id SERIAL PRIMARY KEY,
 Library_name VARCHAR (50) NOT NULL,
 Library_address VARCHAR (100) NOT NULL,
 Library_books_capacity SMALLINT NOT NULL
)

SELECT * FROM library; 

INSERT INTO library (library_id, library_name,library_address, library_books_capacity)
VALUES('1','National Library','9310 Hall St Adrian,MI 49221',1200)

INSERT INTO library (library_id, library_name,library_address, library_books_capacity)
VALUES('2','City Library','279 S. Gainsway Court Indiapolis,IN 46201', 400)

INSERT INTO library (library_id, library_name,library_address, library_books_capacity)
VALUES('3','Johns Hopkins','7 East Golf St.Augusta, GA 30906',1000)

INSERT INTO library (library_id, library_name,library_address, library_books_capacity)
VALUES('4','UCLA Medical Library','7640 N.Center Street Wisconsis Rapids, WI 54494', 1500)

SELECT * FROM library; 

CREATE TABLE Book(
 Book_id SERIAL PRIMARY KEY,
 Book_title VARCHAR (50) NOT NULL,
 Book_author VARCHAR (100) NOT NULL,
 Library_ID SMALLINT NOT NULL,
 Year_of_release SMALLINT NOT NULL
)

SELECT * FROM Book; 


INSERT INTO Book (Book_id, Book_title, Book_author, Library_ID,Year_of_release)
VALUES('1','Harry Potter and the Prisoner of Azkaban','J.K Rowling',2 ,2004)

INSERT INTO Book (Book_id, Book_title, Book_author, Library_ID,Year_of_release)
VALUES('2','The Hunger Games','Suzanne Collins', 4, 2008)

INSERT INTO Book (Book_id, Book_title, Book_author, Library_ID,Year_of_release)
VALUES('3','Twilight','Stephenie Meyer',4, 2005)

INSERT INTO Book (Book_id, Book_title, Book_author, Library_ID,Year_of_release)
VALUES('4','The Fault in Our Stars','John Green', )

INSERT INTO Book (Book_id, Book_title, Book_author, Library_ID,Year_of_release)
VALUES('5','Angels & Demons','Dan Brown',3 ,2000)

INSERT INTO Book (Book_id, Book_title, Book_author, Library_ID,Year_of_release)
VALUES('6','Pride and Prejudice','Jane Austen ', 3, 1813)

INSERT INTO Book (Book_id, Book_title, Book_author, Library_ID,Year_of_release)
VALUES('7','The Kite Runner','Khaled Hosseini',1, 2003)

INSERT INTO Book (Book_id, Book_title, Book_author, Library_ID,Year_of_release)
VALUES('8','Divergent','Veronica Roth', 1, 2011)

INSERT INTO Book (Book_id, Book_title, Book_author, Library_ID,Year_of_release)
VALUES('9','1984','George Orwell, Enrich Fromm, Celal Uster', 2, 1949)

INSERT INTO Book (Book_id, Book_title, Book_author, Library_ID,Year_of_release)
VALUES('10','Animal Farm:A Firy Story','George Orwell', 2, 1945)


SELECT book.book_title, book.book_author, library.library_name
FROM book
INNER JOIN library
ON book.library_id = library.library_id;